import java.util.Scanner;
public class tra {

    public static void main(String[] args){
        int n=0;
        String g,t;


        ID2 i2 = new ID2();
        ID i1 = new ID();
        System.out.println();
        System.out.println("-------------------------------");
        System.out.println("|此脚本不会透露您的信息，请放心使用。|");
        System.out.println("-------------------------------");
        System.out.println("请输入您的有效身份证号码：");

        Object[][] idtoad = {

                {"430000", "湖南",},
                {"430100", "湖南", "长沙"},
                {"430101", "湖南", "长沙", "市辖区"},
                {"430102", "湖南", "长沙", "芙蓉区"},
                {"430103", "湖南", "长沙", "天心区"},
                {"430104", "湖南", "长沙", "岳麓区"},
                {"430105", "湖南", "长沙", "开福区"},
                {"430111", "湖南", "长沙", "雨花区"},
                {"430121", "湖南", "长沙", "长沙县"},
                {"430122", "湖南", "长沙", "望城县"},
                {"430124", "湖南", "长沙", "宁乡县"},
                {"430181", "湖南", "长沙", "浏阳市"},
                {"430200", "湖南", "株洲"},
                {"430201", "湖南", "株洲", "市辖区"},
                {"430202", "湖南", "株洲", "荷塘区"},
                {"430203", "湖南", "株洲", "芦淞区"},
                {"430204", "湖南", "株洲", "石峰区"},
                {"430211", "湖南", "株洲", "天元区"},
                {"430221", "湖南", "株洲", "株洲县"},
                {"430223", "湖南", "株洲", "攸县"},
                {"430224", "湖南", "株洲", "茶陵县"},
                {"430225", "湖南", "株洲", "炎陵县"},
                {"430281", "湖南", "株洲", "醴陵市"},
                {"430300", "湖南", "湘潭"},
                {"430301", "湖南", "湘潭", "市辖区"},
                {"430302", "湖南", "湘潭", "雨湖区"},
                {"430304", "湖南", "湘潭", "岳塘区"},
                {"430321", "湖南", "湘潭", "湘潭县"},
                {"430381", "湖南", "湘潭", "湘乡市"},
                {"430382", "湖南", "湘潭", "韶山市"},
                {"430400", "湖南", "衡阳"},
                {"430401", "湖南", "衡阳", "市辖区"},
                {"430402", "湖南", "衡阳", "江东区"},
                {"430403", "湖南", "衡阳", "城南区"},
                {"430404", "湖南", "衡阳", "城北区"},
                {"430411", "湖南", "衡阳", "郊区"},
                {"430412", "湖南", "衡阳", "南岳区"},
                {"430421", "湖南", "衡阳", "衡阳县"},
                {"430422", "湖南", "衡阳", "衡南县"},
                {"430423", "湖南", "衡阳", "衡山县"},
                {"430424", "湖南", "衡阳", "衡东县"},
                {"430426", "湖南", "衡阳", "祁东县"},
                {"430481", "湖南", "衡阳", "耒阳市"},
                {"430482", "湖南", "衡阳", "常宁市"},
                {"430500", "湖南", "邵阳"},
                {"430501", "湖南", "邵阳", "市辖区"},
                {"430502", "湖南", "邵阳", "双清区"},
                {"430503", "湖南", "邵阳", "大祥区"},
                {"430511", "湖南", "邵阳", "北塔区"},
                {"430521", "湖南", "邵阳", "邵东县"},
                {"430522", "湖南", "邵阳", "新邵县"},
                {"430523", "湖南", "邵阳", "邵阳县"},
                {"430524", "湖南", "邵阳", "隆回县"},
                {"430525", "湖南", "邵阳", "洞口县"},
                {"430527", "湖南", "邵阳", "绥宁县"},
                {"430528", "湖南", "邵阳", "新宁县"},
                {"430529", "湖南", "邵阳", "城步苗族自治县"},
                {"430581", "湖南", "邵阳", "武冈市"},
                {"430600", "湖南", "岳阳"},
                {"430601", "湖南", "岳阳", "市辖区"},
                {"430602", "湖南", "岳阳", "岳阳楼区"},
                {"430603", "湖南", "岳阳", "云溪区"},
                {"430611", "湖南", "岳阳", "君山区"},
                {"430621", "湖南", "岳阳", "岳阳县"},
                {"430623", "湖南", "岳阳", "华容县"},
                {"430624", "湖南", "岳阳", "湘阴县"},
                {"430626", "湖南", "岳阳", "平江县"},
                {"430681", "湖南", "岳阳", "汨罗市"},
                {"430682", "湖南", "岳阳", "临湘市"},
                {"430700", "湖南", "常德"},
                {"430701", "湖南", "常德", "市辖区"},
                {"430702", "湖南", "常德", "武陵区"},
                {"430703", "湖南", "常德", "鼎城区"},
                {"430721", "湖南", "常德", "安乡县"},
                {"430722", "湖南", "常德", "汉寿县"},
                {"430723", "湖南", "常德", "澧县"},
                {"430724", "湖南", "常德", "临澧县"},
                {"430725", "湖南", "常德", "桃源县"},
                {"430726", "湖南", "常德", "石门县"},
                {"430781", "湖南", "常德", "津市市"},
                {"430800", "湖南", "张家界"},
                {"430801", "湖南", "张家界", "市辖区"},
                {"430802", "湖南", "张家界", "永定区"},
                {"430811", "湖南", "张家界", "武陵源区"},
                {"430821", "湖南", "张家界", "慈利县"},
                {"430822", "湖南", "张家界", "桑植县"},
                {"430900","湖南","益阳"},
                {"430901", "湖南", "益阳", "市辖区"},
                {"430902", "湖南", "益阳", "资阳区"},
                {"430903", "湖南", "益阳", "赫山区"},
                {"430921", "湖南", "益阳", "南县"},
                {"430922", "湖南", "益阳", "桃江县"},
                {"430923", "湖南", "益阳", "安化县"},
                {"430981", "湖南", "益阳", "沅江市"},
                {"431000", "湖南", "郴州"},
                {"431001", "湖南", "郴州", "市辖区"},
                {"431002", "湖南", "郴州", "北湖区"},
                {"431003", "湖南", "郴州", "苏仙区"},
                {"431021", "湖南", "郴州", "桂阳县"},
                {"431022", "湖南", "郴州", "宜章县"},
                {"431023", "湖南", "郴州", "永兴县"},
                {"431024", "湖南", "郴州", "嘉禾县"},
                {"431025", "湖南", "郴州", "临武县"},
                {"431026", "湖南", "郴州", "汝城县"},
                {"431027", "湖南", "郴州", "桂东县"},
                {"431028", "湖南", "郴州", "安仁县"},
                {"431081", "湖南", "郴州", "资兴市"},
                {"431100", "湖南", "永州"},
                {"431101", "湖南", "永州", "市辖区"},
                {"431102", "湖南", "永州", "零陵区"},
                {"431103", "湖南", "永州", "冷水滩区"},
                {"431121", "湖南", "永州", "祁阳县"},
                {"431122", "湖南", "永州", "东安县"},
                {"431123", "湖南", "永州", "双牌县"},
                {"431124", "湖南", "永州", "道县"},
                {"431125", "湖南", "永州", "江永县"},
                {"431126", "湖南", "永州", "宁远县"},
                {"431127", "湖南", "永州", "蓝山县"},
                {"431128", "湖南", "永州", "新田县"},
                {"431129", "湖南", "永州", "江华瑶族自治县"},
                {"431200", "湖南", "怀化"},
                {"431201", "湖南", "怀化", "市辖区"},
                {"431202", "湖南", "怀化", "鹤城区"},
                {"431221", "湖南", "怀化", "中方县"},
                {"431222", "湖南", "怀化", "沅陵县"},
                {"431223", "湖南", "怀化", "辰溪县"},
                {"431224", "湖南", "怀化", "溆浦县"},
                {"431225", "湖南", "怀化", "会同县"},
                {"431226", "湖南", "怀化", "麻阳苗族自治县"},
                {"431227", "湖南", "怀化", "新晃侗族自治县"},
                {"431228", "湖南", "怀化", "芷江侗族自治县"},
                {"431229", "湖南", "怀化", "靖州苗族侗族自治县"},
                {"431230", "湖南", "怀化", "通道侗族自治县"},
                {"431281", "湖南", "怀化", "洪江市"},
                {"432500", "湖南", "娄底地区"},
                {"432501", "湖南", "娄底地区", "娄底市"},
                {"432502", "湖南", "娄底地区", "冷水江市"},
                {"432503", "湖南", "娄底地区", "涟源市"},
                {"432522", "湖南", "娄底地区", "双峰县"},
                {"432524", "湖南", "娄底地区", "新化县"},
                {"433000", "湖南", "怀化"},
                {"433001", "湖南", "怀化"},
                {"433100", "湖南", "湘西土家族苗族自治州"},
                {"433101", "湖南", "湘西土家族苗族自治州", "吉首市"},
                {"433122", "湖南", "湘西土家族苗族自治州", "泸溪县"},
                {"433123", "湖南", "湘西土家族苗族自治州", "凤凰县"},
                {"433124", "湖南", "湘西土家族苗族自治州", "花垣县"},
                {"433125", "湖南", "湘西土家族苗族自治州", "保靖县"},
                {"433126", "湖南", "湘西土家族苗族自治州", "古丈县"},
                {"433127", "湖南", "湘西土家族苗族自治州", "永顺县"},
                {"433130", "湖南", "湘西土家族苗族自治州", "龙山县"},
                {"430112", "湖南", "长沙", "望城区"},
                {"430182", "湖南", "长沙", "宁乡市"},
                {"430405", "湖南", "衡阳", "珠晖区"},
                {"430406", "湖南", "衡阳", "雁峰区"},
                {"430407", "湖南", "衡阳", "石鼓区"},
                {"430408", "湖南", "衡阳", "蒸湘区"},
                {"431302", "湖南", "娄底", "娄星区"},
                {"431321", "湖南", "娄底", "双峰县"},
                {"431322", "湖南", "娄底", "新化县"},
                {"431381", "湖南", "娄底", "冷水江市"},
                {"431382", "湖南", "娄底", "涟源市"},

        };

        if(i2.ee.equals("y")) {
            Scanner input = new Scanner(System.in);

            String q = input.next();
            i2.shenhe(q);
            i1.xingzuo(q);
            if(i2.ee.equals("y")) {
                for (int i = 0; i < idtoad.length; i++) {
                    if (idtoad[i][0].equals(q.substring(0, 6))) {//到第6位结束
                        StringBuilder str = new StringBuilder();//创建字符拼接变量
                        for (int j = 1; j < idtoad[i].length; j++) {
                            str.append(idtoad[i][j]);//拼接
                        }
                        System.out.println("您来自" + str);
                    }

                }
            }

            if(i2.ee.equals("y")) {
            g = q.substring(16, 17);//获取第17位
            n = Integer.parseInt(g);//把第17位转为整型n
            if (n % 2 == 0) {

                System.out.println("您是一个漂亮的女孩");
            } else {
                System.out.println("您是一个帅气的男孩");
            }
        }

        }





    }
}
